---
kind: type
id: T:Autodesk.Revit.UI.Events.IdlingEventArgs
source: html/92e2300b-b4b1-af35-221a-cfbeb22c8705.htm
---
# Autodesk.Revit.UI.Events.IdlingEventArgs

The event arguments used by the Idling event.

## Syntax (C#)
```csharp
public class IdlingEventArgs : RevitAPIPreEventArgs
```